const names = ['Николай', 'Таня', 'Сургей', 'Оля', 'Иван', 'Егор'];

const createPicture = (index) => ({
  id: index, //число от 1 до 25, идентификаторы не должны повторяться.
  url: 'photos/{{index}}.jpg', // адрес фото, где index-число от 1 до 25, фото не должны повторяться.
  description: 'описание фотогафии',
  likes: index, //кол-во лайков от 15 до 200, поставленных фото.
  comments: [{ //кол-во комментариев к каждой фотографии случайное число от 0 до 30
    id: index, //любое число, идентификаторы не должны повторяться.
    avatar: 'img/avatar-{{index}}.svg', //адрес аватарки, где index-число от 1 до 6, не должны повторяться
    message: 'В целом всё неплохо. Но не всё.',
    name: names[index],
  }]
});
